tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "osx-cross/avr"
tap "px4/px4"
tap "sanemat/font"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "atomicparsley", link: false
brew "avr-gcc@7"
brew "avrdude"
brew "boost"
brew "glib"
brew "openssl@1.1"
brew "python@3.9"
brew "gcc"
brew "openblas"
brew "suite-sparse"
brew "circleci"
brew "cmake", link: false
brew "dfu-programmer"
brew "direnv"
brew "docker", link: false
brew "faac", link: false
brew "libevent"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "python@3.11", link: false
brew "fontforge"
# brew "git"
brew "gobject-introspection"
brew "guile"
brew "hdf5"
brew "helm"
brew "htop"
brew "jq"
brew "libfido2"
brew "mysql-client"
brew "netcdf"
brew "nmap", link: false
brew "numpy"
brew "qt@5"
brew "vtk"
brew "opencv"
brew "python-tk@3.11"
brew "python@3.8"
brew "zsh"
brew "reattach-to-user-namespace"
brew "tmux"
brew "px4/px4/gcc-arm-none-eabi"
brew "sanemat/font/ricty", args: ["with-powerline"]
brew "nvm"

# https://github.com/yuru7/HackGen
brew "font-hackgen"
brew "font-hackgen-nerd"

# vscode
cask "visual-studio-code"

# GUI Apps
# cask "microsoft-edge"
# cask "postman"
cask "firefox"
cask "google-chrome"
cask "microsoft-remote-desktop"
# cask "slack"
cask "discord"