tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "osx-cross/avr"
tap "px4/px4"
tap "sanemat/font"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "atomicparsley", link: false
brew "avr-gcc@7"
brew "avrdude"
brew "boost"
brew "glib"
brew "openssl@1.1"
brew "python@3.9"
brew "gcc"
brew "openblas"
brew "suite-sparse"
brew "circleci"
brew "cmake", link: false
brew "dfu-programmer"
brew "direnv"
brew "docker", link: false
brew "faac", link: false
brew "libevent"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "python@3.11", link: false
brew "fontforge"
# brew "git"
brew "gobject-introspection"
brew "guile"
brew "hdf5"
brew "helm"
brew "htop"
brew "jq"
brew "libfido2"
brew "mysql-client"
brew "netcdf"
brew "nmap", link: false
brew "numpy"
brew "qt@5"
brew "vtk"
brew "opencv"
brew "python-tk@3.11"
brew "python@3.8"
brew "zsh"
brew "reattach-to-user-namespace"
brew "tmux"
brew "px4/px4/gcc-arm-none-eabi"
brew "sanemat/font/ricty", args: ["with-powerline"]
brew "nvm"

# https://github.com/yuru7/HackGen
brew "font-hackgen"
brew "font-hackgen-nerd"

# vscode
cask "visual-studio-code"
vscode "42Crunch.vscode-openapi"
vscode "adam-bender.commit-message-editor"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "atlassian.atlascode"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "CircleCI.circleci"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hangxingliu.vscode-systemd-support"
vscode "hbenl.vscode-test-explorer"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "lfs.vscode-emacs-friendly"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mark-tucker.aws-cli-configure"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "Orta.vscode-jest"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SonarSource.sonarlint-vscode"
vscode "supperchong.pretty-json"
vscode "techer.open-in-browser"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"

# GUI Apps
cask "microsoft-edge"
cask "postman"
cask "firefox"
cask "google-chrome"
cask "microsoft-remote-desktop"
cask "slack"
cask "discord"